app/views/users/show.html.erb

SELECT COUNT(*) FROM "projects"
---
      <% if @projects.any? %>
          <h3>Projects(<%= @projects.count %>)</h3>