app/views/projects/show.html.erb

SELECT "developers".* FROM "developers"
---
        <h3>Developers Assigned</h3>
        <% @developer_assigned.developers.each do |developer| %>