app/views/assigns/_form.html.erb

SELECT "projects".* FROM "projects"
SELECT "developers".* FROM "developers"
---

    <%= f.select :project_id, Project.all.collect { |p| [ p.name, p.id ] } %>

    <%= f.select :developer_id, Developer.all.collect { |p| [ p.name, p.id ] } %>