app/controllers/assigns_controller.rb

  def show
    @assign = Assign.find(params[:id])
---
SELECT  "assigns".* FROM "assigns" WHERE "assigns"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]

  def create
    @assign = Assign.new(assign_params)
    if @assign.save
---
INSERT INTO "assigns" ("developer_id", "project_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["developer_id", 1], ["project_id", 1], ["created_at", 2017-01-15 17:21:00 UTC], ["updated_at", 2017-01-15 17:21:00 UTC]]

  def destroy
    @assign.destroy
---
DELETE FROM "assigns" WHERE "assigns"."id" = ?  [["id", 4]]

  def delete_developerAssign
    @developer_assign =  Assign.where("developer_id = ? AND project_id = ?", params[:developer] , params[:project ]  ).first
    Assign.destroy(@developer_assign.id)
---
SELECT  "assigns".* FROM "assigns" WHERE (developer_id = '5' AND project_id = '4') ORDER BY "assigns"."id" ASC LIMIT ?  [["LIMIT", 1]]
DELETE FROM "assigns" WHERE "assigns"."id" = ?  [["id", 15]]