app/controllers/developers_controller.rb

  def index
    @developers = Developer.paginate(page: params[:page])
---
SELECT  "developers".* FROM "developers" LIMIT ? OFFSET ?  [["LIMIT", 30], ["OFFSET", 0]]
SELECT COUNT(*) FROM "developers"

  def show
    @developer = Developer.find(params[:id])
    @projects_assigned = Developer.includes(:projects).find(params[:id])
---
SELECT  "developers".* FROM "developers" WHERE "developers"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "projects".* FROM "projects" WHERE "projects"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]

  def create
    @developer = Developer.new(developer_params)
    if @developer.save
---
INSERT INTO "developers" ("name", "surname", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "mam"], ["surname", "lll"], ["created_at", 2017-01-14 21:29:40 UTC], ["updated_at", 2017-01-14 21:29:40 UTC]]

  def destroy
    @developer.destroy
---
DELETE FROM "developers" WHERE "developers"."id" = ?  [["id", 1]]