app/controllers/projects_controller.rb

SELECT  "projects".* FROM "projects" WHERE "projects"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "developers".* FROM "developers" WHERE "developers"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]
---
  def show
    @project = Project.find(params[:id])
    @developer_assigned = Project.includes(:developers).find(params[:id])

INSERT INTO "projects" ("name", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "Java"], ["description", "klsjdlkasjda"], ["created_at", 2017-01-15 16:26:56 UTC], ["updated_at", 2017-01-15 16:26:56 UTC]]
---
  def create
    @project = Project.new(project_params)
    if @project.save