app/controllers/static_pages_controller.rb

  def home
    @projects = Project.paginate(page: params[:page])
---
SELECT  "projects".* FROM "projects" LIMIT ? OFFSET ?  [["LIMIT", 30], ["OFFSET", 0]]
SELECT COUNT(*) FROM "projects"