app/controllers/users_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "projects".* FROM "projects" LIMIT ? OFFSET ?  [["LIMIT", 30], ["OFFSET", 0]]
SELECT COUNT(*) FROM "projects"
---
  def show
    @user = User.find(params[:id])
    # @books = @user.books.paginate(page: params[:page])
    @projects = Project.paginate(page: params[:page])